In [3]:
import pandas as pd #import pandas
#create student dataframe by reading csv file
df=pd.read_csv("marks_data.csv")
print(df.head())

   STUDENT_ID             Name  Match  Science  English  Total           Grade
0           1   Dallas Flisher     82       48       83     56          mobile
1           2   Gilberta Ruoff     97       49       26    186          mobile
2           3      Peg Domoney     60       50       56     33      complexity
3           4  Frederich Kaley     29       80       30    280        Devolved
4           5     Nady Tiffney     10       77       25     13  data-warehouse

In [4]:
df.isna()

    STUDENT_ID   Name  Match  Science  English  Total  Grade
0        False  False  False    False    False  False  False
1        False  False  False    False    False  False  False
2        False  False  False    False    False  False  False
3        False  False  False    False    False  False  False
4        False  False  False    False    False  False  False
..         ...    ...    ...      ...      ...    ...    ...
95       False  False  False    False    False  False  False
96       False  False  False    False    False  False  False
97       False  False  False    False    False  False  False
98       False  False  False    False    False  False  False
99       False  False  False    False    False  False  False

[100 rows x 7 columns]

In [5]:

df['total']=df[['Match','Science','English']].sum(axis=1)
df[['Name','Match','Science','English','Total']].head()

              Name  Match  Science  English  Total
0   Dallas Flisher     82       48       83     56
1   Gilberta Ruoff     97       49       26    186
2      Peg Domoney     60       50       56     33
3  Frederich Kaley     29       80       30    280
4     Nady Tiffney     10       77       25     13

In [7]:
def assign_grade(total):
    if total>=250:
        return 'A'
    elif total>=200:
        return 'B'
    elif total>=150:
        return 'C'
    else:
        return 'D'

In [8]:
df['Grade']=df['Total'].apply(assign_grade)

In [11]:
print(df[["Name","Total","Grade"]])

                Name  Total Grade
0     Dallas Flisher     56     D
1     Gilberta Ruoff    186     C
2        Peg Domoney     33     D
3    Frederich Kaley    280     A
4       Nady Tiffney     13     D
..               ...    ...   ...
95  Elvina Danihelka    279     A
96      Ilsa Yankeev    225     B
97    Ferdy Raubheim    281     A
98      Jasmin Isacq    288     A
99     Naomi Kenrick     99     D

[100 rows x 3 columns]

In [14]:
df[["Name","Total","Grade"]].tail()

                Name  Total Grade
95  Elvina Danihelka    279     A
96      Ilsa Yankeev    225     B
97    Ferdy Raubheim    281     A
98      Jasmin Isacq    288     A
99     Naomi Kenrick     99     D

In [17]:
grade_a_students=df[df['Grade']=='A']

In [18]:
print(grade_a_students)

    STUDENT_ID              Name  Match  Science  English  Total Grade  total
3            4   Frederich Kaley     29       80       30    280     A    139
8            9      Saunder Faas     62       16       51    274     A    129
17          18    Brana Glassard      3       61       67    274     A    131
33          34    Marina Petkens     36       79        8    251     A    123
68          69   Giralda Farnish     22       93       99    300     A    214
73          74    Rivkah Cottage      5       26        5    266     A     36
75          76   Thorny Wrighton     97       89       69    291     A    255
80          81    Ervin Zukerman     39       43       39    280     A    121
81          82  Torrie MacDermid     36       63       10    275     A    109
84          85     Maddie Entres     23       34       86    278     A    143
88          89   Sharona Fihelly     82       29       20    250     A    131
93          94        Natty Dyte     37       64       85    265     A    186
95          96  Elvina Danihelka     54       58       23    279     A    135
97          98    Ferdy Raubheim      0       53      100    281     A    153
98          99      Jasmin Isacq     99       63       86    288     A    248

In [19]:
grade_b_students=df[df['Grade']=='B']
print(len(grade_b_students))

15

In [20]:
print(len(df[df['Grade']=='D']))

46

In [22]:
math_max=max(df['Match'])
print(math_max)

100

In [23]:
print(df[df['Match']==math_max])

    STUDENT_ID            Name  Match  Science  English  Total Grade  total
23          24  Onofredo Sture    100       71       71    227     B    242

In [25]:
df.to_csv("marks_new.csv", index=False)
print("Data saved Sucessfully!")

Data saved Sucessfully!